In [7]:
import mysql.connector

from mysql.connector import Error

In [6]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\sara\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (8.1.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in c:\users\sara\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from mysql-connector-python) (4.21.12)
Note: you may need to restart the kernel to use updated packages.

In [8]:
try: 
    connection = mysql.connector.connect(host='35.208.82.175', 
                                         database='dbgsipp7ucsuwy',
                                         user='uqsnolewgvge8',
                                         password='upgradehub', connection_timeout=180)

    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL database... MySQL Server version on ", db_Info)

        cursor = connection.cursor()
        connection.commit()

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    # closing database connection.
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL database... MySQL Server version on  5.7.39-42-log
MySQL connection is closed

EMPEZAMOS A CONECTARNOS Y A EXTRAER INFO:

In [18]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()

SABER TABLAS

In [12]:
import pandas as pd

In [15]:
pd.read_sql('SHOW TABLES', con= connection)
#vuelvo a leer connection y hago esto después. Lee lass tablas que tenemos

C:\Users\Sara\AppData\Local\Temp\ipykernel_11672\1460944650.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('SHOW TABLES', con= connection)

  Tables_in_dbgsipp7ucsuwy
0                 EMPLEADO
1                   PEDIDO
2      PEDIDOS_FINALIZADOS
3                 PRODUCTO
4        RANKING_PRODUCTOS
5               REPARTIDOR
6                   consta
7           esta_compuesto
8                    users

OBTENER EL LISTADO DE TODOS LOS PRODUCTOS

In [11]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query1 = """ SELECT * FROM PRODUCTO; """  #para hacer una consulta se coge este patrón
cursor.execute(query1)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [20]:
#volver a leer connection
df1= pd.read_sql(query1, con= connection)
df1

C:\Users\Sara\AppData\Local\Temp\ipykernel_11672\2648103261.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1= pd.read_sql(query1, con= connection)

   Codigo                         Nombre  Precio
0      01                    Hamburguesa     2.6
1      02                        Patatas     2.0
2      03                         tomate     0.5
3      04                          Queso     1.0
4      05                        Lechuga     0.5
5      06                          Pollo     3.6
6      08                          Bacon     1.5
7      09                      Coca cola     3.0
8      10                         Nestea     3.0
9      11                  Menú de Pollo     5.0
10     12  Menú de Hamburguesa con queso     6.0
11     13        Menú de Pollo con queso     6.0
12     14            Menú de Hamburguesa     6.0
13     15                         Helado     1.0
14     16                          Tarta     2.0
15     17                          Fruta     1.0
16     18                           Agua     2.0
17     19                          Fanta     3.0

Obtener el número de pedido, dni del repartidor y hora de reparto de aquellos
pedidos que se toman nota después de las siete de la tarde.

In [23]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query2 = """ SELECT DNI_R, Hora_rep FROM PEDIDO WHERE Hora_tm >'19:00' and Hora_rep
is not null """
cursor.execute(query2)
cursor.fetchall()
df2 = pd.read_sql(query2, con=connection)
df2

C:\Users\Sara\AppData\Local\Temp\ipykernel_11672\1529357203.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, con=connection)

       DNI_R        Hora_rep
0  14188151T 0 days 19:45:00
1  04477744T 0 days 21:45:00
2  14188151T 0 days 23:35:00

Obtener todos los campos de empleados que cobran entre 900 y 1000 euros.

In [46]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query3 = """ SELECT* FROM EMPLEADO WHERE Salario BETWEEN 900 AND 1000"""
cursor.execute(query3)
cursor.fetchall()
df3 = pd.read_sql(query3, con=connection)
df3

C:\Users\Sara\AppData\Local\Temp\ipykernel_11672\3317841336.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df3 = pd.read_sql(query3, con=connection)

         DNI                 Nombre          Nss   Turno  Salario
0  04444444T   Úrsula Delta Camacho  11177788899  mañana    900.0
1  11111111Q     Luis Ramírez Pardo  23445556666  mañana    900.0
2  14111155T   Sergio Lérida Campos  55577700089   tarde   1000.0
3  22222222S      María Sánchez Cid  11112223334   tarde   1000.0
4  33333333M  Martín Guerrero López  33344455566   tarde   1000.0
5  55555555J   Carmen Hernández Pío  99966633311  mañana    900.0
6  77777777M     Pedro Jiménez Ruiz  23456785432   tarde   1000.0
7  99999999X      Raúl Rodrigo Roca  55566677789   tarde   1000.0

Obtener el número de pedido e importe de aquellos que han sido registrados en el mes de noviembre de 2020 y su importe es mayor a 15 Euros.

In [34]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query4 = """ SELECT Numero,importe FROM PEDIDO WHERE fecha BETWEEN '2020-11-01' AND '2020-11-30' AND importe>'15' """
cursor.execute(query4)
cursor.fetchall()

[('0006', 23.0), ('0009', 25.0), ('0010', 45.0), ('0011', 45.0)]

Obtener por cada uno de los repartidores su DNI junto a la cantidad de pedidos entregados.

In [36]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query5 = """ SELECT DNI_R, COUNT(*) FROM PEDIDO WHERE DNI_R is not null GROUP BY DNI_R"""
cursor.execute(query5)
cursor.fetchall()

[('04477744T', 2),
 ('11245621Q', 1),
 ('14188151T', 2),
 ('55675675J', 1),
 ('99009900J', 3)]

Obtener por cada mes (con el formato de nombre y no de número ej. Noviembre),la cantidad
de pedidos realizados.

In [39]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query6 = """ SELECT MONTHNAME (Fecha) AS mes, COUNT(*) FROM PEDIDO GROUP BY mes"""
cursor.execute(query6)
cursor.fetchall()

[('November', 6), ('October', 2), ('September', 3)]

Obtener un listado con el nombre y dni de los empleados en el mismo campo y
anteponiendo el dni al nombre de la siguiente forma (ej; 45776633P, Juan Rodríguez López)
que tenga turno de “tarde” o "noche". Ordenar el listado por dni.

In [41]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query7 = """ SELECT CONCAT (DNI,', ', nombre) as EMPLEADO, turno FROM EMPLEADO WHERE turno IN ('tarde', 'noche') ORDER BY DNI"""
cursor.execute(query7)
cursor.fetchall()

[('03232323P, María Luisa Galdón Ter', 'noche'),
 ('14111155T, Sergio Lérida Campos', 'tarde'),
 ('14567555L, Piedad Colmenero Zapillo', 'noche'),
 ('22222222S, María Sánchez Cid', 'tarde'),
 ('33333333M, Martín Guerrero López', 'tarde'),
 ('77777777M, Pedro Jiménez Ruiz', 'tarde'),
 ('88888888O, Soledad Campillo Molina', 'noche'),
 ('99999999X, Raúl Rodrigo Roca', 'tarde')]

Obtener el nombre, código y precio de aquellos productos que superen o igualen
la media de todos los precios. Ordenar de mayor a menor precio.

In [43]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query8 = """ SELECT nombre, codigo, precio FROM PRODUCTO WHERE Precio >= (SELECT AVG(Precio) FROM PRODUCTO) ORDER BY Precio DESC"""
cursor.execute(query8)
cursor.fetchall()

[('Menú de Hamburguesa con queso', '12', 6.0),
 ('Menú de Pollo con queso', '13', 6.0),
 ('Menú de Hamburguesa', '14', 6.0),
 ('Menú de Pollo', '11', 5.0),
 ('Pollo', '06', 3.6),
 ('Coca cola', '09', 3.0),
 ('Nestea', '10', 3.0),
 ('Fanta', '19', 3.0)]

In [47]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query8 = """ SELECT nombre, codigo, precio FROM PRODUCTO WHERE Precio >= (SELECT AVG(Precio) FROM PRODUCTO) ORDER BY Precio DESC"""
cursor.execute(query8)
cursor.fetchall()
df8 = pd.read_sql(query8, con=connection)
df8

C:\Users\Sara\AppData\Local\Temp\ipykernel_11672\356435517.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df8 = pd.read_sql(query8, con=connection)

                          nombre codigo  precio
0  Menú de Hamburguesa con queso     12     6.0
1        Menú de Pollo con queso     13     6.0
2            Menú de Hamburguesa     14     6.0
3                  Menú de Pollo     11     5.0
4                          Pollo     06     3.6
5                      Coca cola     09     3.0
6                         Nestea     10     3.0
7                          Fanta     19     3.0

Obtener un listado con el nombre y DNI de los empleados que no han preparado
nunca ningún pedido.

In [44]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query9 = """ SELECT Nombre, DNI FROM EMPLEADO WHERE DNI NOT IN (SELECT DISTINCT dni_ep FROM PEDIDO)"""
cursor.execute(query9)
cursor.fetchall()

[('Luis Ramírez Pardo', '11111111Q'),
 ('Sergio Lérida Campos', '14111155T'),
 ('Raúl Rodrigo Roca', '99999999X')]

Obtener el código, nombre y precio de los productos(estos dos últimos en el mismo
campo) que están contenidos en los pedidos que ha tomado nota "Luis" o "María
Luisa". Ordena el listado de mayor a menor valor por fecha del pedido.

In [65]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query10 = """ SELECT PR.Codigo, E.Nombre, CONCAT(PR.Nombre, ' ' , PR.Precio) AS NOMBRE_PRECIO

                FROM PRODUCTO PR, PEDIDO P, consta C, EMPLEADO E

                WHERE PR.Codigo = C.Codigo_Pr

                AND P.Numero= C.Numero_P

                AND P.DNI_ETM= E.DNI

                AND E.nombre LIKE '%Luis%'
               

                ORDER BY P.Fecha DESC """
cursor.execute(query10)
cursor.fetchall()
# al poner %Luis% te filtra los nombres que continen Luis, tanto luis como luisa 
# si ponemos E.Nombre te imprime también el nombre de quien realizó el pedido

[('12', 'Luis Ramírez Pardo', 'Menú de Hamburguesa con queso 6.00'),
 ('11', 'Luis Ramírez Pardo', 'Menú de Pollo 5.00'),
 ('12', 'María Luisa Galdón Ter', 'Menú de Hamburguesa con queso 6.00'),
 ('09', 'María Luisa Galdón Ter', 'Coca cola 3.00'),
 ('02', 'María Luisa Galdón Ter', 'Patatas 2.00')]

In [66]:
df10 = pd.read_sql(query10, con=connection)
df10

C:\Users\Sara\AppData\Local\Temp\ipykernel_11672\1179300868.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df10 = pd.read_sql(query10, con=connection)

  Codigo                  Nombre                       NOMBRE_PRECIO
0     12      Luis Ramírez Pardo  Menú de Hamburguesa con queso 6.00
1     11      Luis Ramírez Pardo                  Menú de Pollo 5.00
2     12  María Luisa Galdón Ter  Menú de Hamburguesa con queso 6.00
3     09  María Luisa Galdón Ter                      Coca cola 3.00
4     02  María Luisa Galdón Ter                        Patatas 2.00

Obtener por cada repartidor, su nombre, cantidad de pedidos y el tiempo medio
que tardan en entregar los pedidos una vez preparados. Ordenar el listado el
tiempo medio que tardan en entregarlos:

In [67]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query11 = """SELECT R.nombre, COUNT(*) AS cantidad_repartos,

TIME_FORMAT(AVG(TIMEDIFF(Hora_rep,Hora_pre)),'%T')AS tiempo_entrega

FROM REPARTIDOR R, PEDIDO P

WHERE R.DNI = P.DNI_R

GROUP BY R.DNI

ORDER BY 3;"""
cursor.execute(query11)
cursor.fetchall()
# &T ccmabia el tiempo a h, min y seg. order by 3 Lo ordena por la columna 3

[('Laura Jiménez Jiménez', 2, '00:12:50'),
 ('Juan Pardo Rubio', 1, '00:15:00'),
 ('Carlos Sánchez Ruíz', 2, '00:19:00'),
 ('Alejandro Pardo López', 3, '00:25:00'),
 ('Juan Sánchez López', 1, '00:30:00')]

Obtener un listado obteniendo el código, nombre y el precio de los productos
cuyo precios sea el más barato o el más caro de todos.

In [68]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query12 = """SELECT Codigo, Nombre, precio

FROM PRODUCTO

WHERE precio = (SELECT MAX(precio)

FROM PRODUCTO)

OR precio = (SELECT MIN(precio)

FROM PRODUCTO);"""
cursor.execute(query12)
cursor.fetchall()

[('03', 'tomate', 0.5),
 ('05', 'Lechuga', 0.5),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0)]

Obtener por cada producto , el nombre y código el número total de pedidos en
los que se encuentra teniendo en cuenta que el total de pedidos en los cuales se
encuentre sea superior o igual a dos. Ordena el listado de mayor a menor
número de productos.

In [69]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query13 = """SELECT PR.nombre, PR.codigo, count(P.Numero) as cantidad_pedidos

FROM PEDIDO P, PRODUCTO PR, consta C

WHERE P.numero = C.numero_P

AND PR.codigo = C.codigo_Pr

GROUP BY PR.codigo

HAVING cantidad_pedidos>=2

ORDER BY cantidad_pedidos DESC;"""
cursor.execute(query13)
cursor.fetchall()

[('Menú de Pollo con queso', '13', 6),
 ('Menú de Hamburguesa con queso', '12', 6),
 ('Menú de Pollo', '11', 3),
 ('Queso', '04', 3),
 ('Helado', '15', 2),
 ('Patatas', '02', 2)]

Mostrar listado de los empleados (código y NSS en la misma columna) que
han tomado nota de algún pedido y contienen el producto de código 13 y
además el repartidor sea 'Laura'.

In [73]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query14 = """SELECT E.nombre, CONCAT(E.DNI, ' ' , E.NSS) as Identificación

FROM EMPLEADO E, PEDIDO P, REPARTIDOR R, consta C

WHERE E.DNI = P.DNI_ETM AND R.DNI= P.DNI_R AND P.numero =

C.numero_P

AND R.nombre LIKE '%Laura%'

AND C.codigo_Pr ='13';"""
cursor.execute(query14)
cursor.fetchall()

[('Raúl Rodrigo Roca', '99999999X 55566677789'),
 ('Piedad Colmenero Zapillo', '14567555L 23456734534')]

Obtener el nombre del producto que es menú junto con el código de los
productos que lo componen en aquellos pedidos del mes de septiembre de
2020.

In [75]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)
cursor=connection.cursor()
query15 = """SELECT P.numero AS numero_pedido,PR.nombre , PR.codigo,

EC.codigo_P_compuesto as

producto_que_lo_compone, PRODUCTO.nombre as descripción_p_que_lo_compone

FROM PRODUCTO PR, PEDIDO P, esta_compuesto EC, consta C, PRODUCTO PRODUCTO

WHERE PR.codigo=EC.codigo_p AND PR.codigo=C.codigo_PR

AND P.numero=C.numero_P AND PRODUCTO.codigo= EC.codigo_p_compuesto

AND P.fecha BETWEEN '2020-09-01' AND '2020-09-30';"""
cursor.execute(query15)
cursor.fetchall()

[('0005', 'Menú de Hamburguesa con queso', '12', '01', 'Hamburguesa'),
 ('0005', 'Menú de Hamburguesa con queso', '12', '02', 'Patatas'),
 ('0005', 'Menú de Hamburguesa con queso', '12', '04', 'Queso'),
 ('0005', 'Menú de Hamburguesa con queso', '12', '10', 'Nestea'),
 ('0005', 'Menú de Hamburguesa con queso', '12', '16', 'Tarta'),
 ('0005', 'Menú de Pollo con queso', '13', '02', 'Patatas'),
 ('0005', 'Menú de Pollo con queso', '13', '04', 'Queso'),
 ('0005', 'Menú de Pollo con queso', '13', '06', 'Pollo'),
 ('0005', 'Menú de Pollo con queso', '13', '08', 'Bacon'),
 ('0005', 'Menú de Pollo con queso', '13', '09', 'Coca cola'),
 ('0005', 'Menú de Pollo con queso', '13', '15', 'Helado'),
 ('0007', 'Menú de Hamburguesa con queso', '12', '01', 'Hamburguesa'),
 ('0007', 'Menú de Hamburguesa con queso', '12', '02', 'Patatas'),
 ('0007', 'Menú de Hamburguesa con queso', '12', '04', 'Queso'),
 ('0007', 'Menú de Hamburguesa con queso', '12', '10', 'Nestea'),
 ('0007', 'Menú de Hamburguesa con queso', '12', '16', 'Tarta'),
 ('0008', 'Menú de Pollo', '11', '02', 'Patatas'),
 ('0008', 'Menú de Pollo', '11', '03', 'tomate'),
 ('0008', 'Menú de Pollo', '11', '06', 'Pollo'),
 ('0008', 'Menú de Pollo', '11', '17', 'Fruta'),
 ('0008', 'Menú de Pollo', '11', '18', 'Agua'),
 ('0008', 'Menú de Pollo con queso', '13', '02', 'Patatas'),
 ('0008', 'Menú de Pollo con queso', '13', '04', 'Queso'),
 ('0008', 'Menú de Pollo con queso', '13', '06', 'Pollo'),
 ('0008', 'Menú de Pollo con queso', '13', '08', 'Bacon'),
 ('0008', 'Menú de Pollo con queso', '13', '09', 'Coca cola'),
 ('0008', 'Menú de Pollo con queso', '13', '15', 'Helado')]